#### Terraform Format and Style 🖌`success`
#### Terraform Initialization 🤖`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

module.vcn.data.oci_core_services.all_oci_services[0]: Reading...
module.vcn.data.oci_core_services.all_oci_services[0]: Read complete after 1s [id=CoreServicesDataSource-0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_core_security_list.private-security-list will be created
  + resource "oci_core_security_list" "private-security-list" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "security-list-for-private-subnet"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = -1
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
    }

  # oci_core_security_list.public-security-list will be created
  + resource "oci_core_security_list" "public-security-list" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "security-list-for-public-subnet"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = -1
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
    }

  # oci_core_subnet.vcn-private-subnet will be created
  + resource "oci_core_subnet" "vcn-private-subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "k8s-private-subnet"
      + dns_label                  = (known after apply)
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_subnet.vcn-public-subnet will be created
  + resource "oci_core_subnet" "vcn-public-subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.0.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "k8s-public-subnet"
      + dns_label                  = (known after apply)
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.vcn.oci_core_default_security_list.lockdown[0] will be created
  + resource "oci_core_default_security_list" "lockdown" {
      + compartment_id             = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = (known after apply)
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + manage_default_resource_id = (known after apply)
      + state                      = (known after apply)
      + time_created               = (known after apply)
    }

  # module.vcn.oci_core_internet_gateway.ig[0] will be created
  + resource "oci_core_internet_gateway" "ig" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "internet-gateway"
      + enabled        = true
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.vcn.oci_core_nat_gateway.nat_gateway[0] will be created
  + resource "oci_core_nat_gateway" "nat_gateway" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "nat-gateway"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + nat_ip         = (known after apply)
      + public_ip_id   = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.vcn.oci_core_route_table.ig[0] will be created
  + resource "oci_core_route_table" "ig" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "internet-route"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at Internet Gateway creation: Internet Gateway as default gateway"
          + destination       = "0.0.0.0/0"
          + destination_type  = (known after apply)
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.vcn.oci_core_route_table.nat[0] will be created
  + resource "oci_core_route_table" "nat" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "nat-route"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at NAT Gateway creation: NAT Gateway as default gateway"
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at Service Gateway creation: All Services in region to Service Gateway"
          + destination       = "all-ams-services-in-oracle-services-network"
          + destination_type  = "SERVICE_CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.vcn.oci_core_route_table.service_gw[0] will be created
  + resource "oci_core_route_table" "service_gw" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "service-gw-route"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at Service Gateway creation: All Services in region to Service Gateway"
          + destination       = "all-ams-services-in-oracle-services-network"
          + destination_type  = "SERVICE_CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.vcn.oci_core_service_gateway.service_gateway[0] will be created
  + resource "oci_core_service_gateway" "service_gateway" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + defined_tags   = (known after apply)
      + display_name   = "service-gateway"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + services {
          + service_id   = "ocid1.service.oc1.eu-amsterdam-1.aaaaaaaahu43fzhusbfx45wcshaaeqj7fszo5j7l6ym75gjld5q4zjofwkqa"
          + service_name = (known after apply)
        }
    }

  # module.vcn.oci_core_vcn.vcn will be created
  + resource "oci_core_vcn" "vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaa2o7oojrmzxbbtjricilgnp7pz4kuvnjuryevsdxyko5nms4d2dka"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "vcn-k8s"
      + dns_label                        = "vcnk8s"
      + freeform_tags                    = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = false
      + is_oracle_gua_allocation_enabled = (known after apply)
      + security_attributes              = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id-for-for-route-table-that-includes-the-nat-gateway  = (known after apply)
  + id-for-route-table-that-includes-the-internet-gateway = (known after apply)
  + nat-gateway-id                                        = (known after apply)
  + private-security-list-OCID                            = (known after apply)
  + private-security-list-name                            = "security-list-for-private-subnet"
  + private-subnet-OCID                                   = (known after apply)
  + private-subnet-name                                   = "k8s-private-subnet"
  + public-security-list-OCID                             = (known after apply)
  + public-security-list-name                             = "security-list-for-public-subnet"
  + public-subnet-OCID                                    = (known after apply)
  + public-subnet-name                                    = "k8s-public-subnet"
  + vcn_id                                                = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @fsavoia, Action: `pull_request`*